---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrained
source: html/13dcaa4c-463b-0557-d8b4-a0d1e36f493b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrained Property

Sketch is overconstrained.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchOverconstrained { get; }
```